---
title: BendingDetailCustomFieldProperties
classe: Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 29
---

# BendingDetailCustomFieldProperties

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get; set; }` | `bendingDetailCustomFieldProperties.AngularDimensionsDisplayOption` | BendingDetailAngularDimensionsDisplayOptions |
| `Boolean AngularDimensionsEnabled { get; set; }` | `bendingDetailCustomFieldProperties.AngularDimensionsEnabled` | Boolean |
| `Boolean AngularDimensionsForHooksEnabled { get; set; }` | `bendingDetailCustomFieldProperties.AngularDimensionsForHooksEnabled` | Boolean |
| `BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions { get; set; }` | `bendingDetailCustomFieldProperties.AngularDimensionsMeasurementOptions` | BendingDetailAngularDimensionsMeasurementOptions |
| `Double AngularDimensionsOffset { get; set; }` | `bendingDetailCustomFieldProperties.AngularDimensionsOffset` | Double |
| `BendingDetailDimensionTextPosition AngularDimensionTextPosition { get; set; }` | `bendingDetailCustomFieldProperties.AngularDimensionTextPosition` | BendingDetailDimensionTextPosition |
| `ElementId AngularDimensionTypeId { get; set; }` | `bendingDetailCustomFieldProperties.AngularDimensionTypeId` | ElementId |
| `Boolean BendDiameterDimensionsEnabled { get; set; }` | `bendingDetailCustomFieldProperties.BendDiameterDimensionsEnabled` | Boolean |
| `Boolean BendDiameterDimensionsForHooksEnabled { get; set; }` | `bendingDetailCustomFieldProperties.BendDiameterDimensionsForHooksEnabled` | Boolean |
| `Boolean BendDiameterDimensionsForSegmentsEnabled { get; set; }` | `bendingDetailCustomFieldProperties.BendDiameterDimensionsForSegmentsEnabled` | Boolean |
| `BendingDetailBendDiameterDimensionType BendDiameterDimensionType { get; set; }` | `bendingDetailCustomFieldProperties.BendDiameterDimensionType` | BendingDetailBendDiameterDimensionType |
| `ElementId DiameterDimensionTypeId { get; set; }` | `bendingDetailCustomFieldProperties.DiameterDimensionTypeId` | ElementId |
| `Boolean IsValidObject { get; }` | `bendingDetailCustomFieldProperties.IsValidObject` | Boolean |
| `ElementId LineStyleId { get; set; }` | `bendingDetailCustomFieldProperties.LineStyleId` | ElementId |
| `BendingDetailCustomFieldMultipleValuesIndicatorOptions MultipleValuesIndicatorOption { get; set; }` | `bendingDetailCustomFieldProperties.MultipleValuesIndicatorOption` | BendingDetailCustomFieldMultipleValuesIndicatorOptions |
| `Boolean OrthogonalAndOverallDimesionsEnabled { get; set; }` | `bendingDetailCustomFieldProperties.OrthogonalAndOverallDimesionsEnabled` | Boolean |
| `BendingDetailDisplayParametersOptions ParametersDisplayOption { get; set; }` | `bendingDetailCustomFieldProperties.ParametersDisplayOption` | BendingDetailDisplayParametersOptions |
| `ElementId RadialDimensionTypeId { get; set; }` | `bendingDetailCustomFieldProperties.RadialDimensionTypeId` | ElementId |
| `BendingDetailFor3DShapesOptions RepresentaionOf3DShapes { get; set; }` | `bendingDetailCustomFieldProperties.RepresentaionOf3DShapes` | BendingDetailFor3DShapesOptions |
| `Boolean SegmentLengthDimensionsEnabled { get; set; }` | `bendingDetailCustomFieldProperties.SegmentLengthDimensionsEnabled` | Boolean |
| `Boolean SegmentLengthDimensionsForHooksEnabled { get; set; }` | `bendingDetailCustomFieldProperties.SegmentLengthDimensionsForHooksEnabled` | Boolean |
| `Double SegmentLengthDimensionsOffset { get; set; }` | `bendingDetailCustomFieldProperties.SegmentLengthDimensionsOffset` | Double |
| `BendingDetailDimensionTextPosition SegmentLengthDimensionTextPosition { get; set; }` | `bendingDetailCustomFieldProperties.SegmentLengthDimensionTextPosition` | BendingDetailDimensionTextPosition |
| `ElementId SegmentLengthDimensionTypeId { get; set; }` | `bendingDetailCustomFieldProperties.SegmentLengthDimensionTypeId` | ElementId |
| `BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption { get; set; }` | `bendingDetailCustomFieldProperties.SegmentLengthsDisplayOption` | BendingDetailSegmentLengthsDisplayOptions |
| `BendingDetailSegmentLengthsDisplayOptions SegmentLengthsForArcsDisplayOption { get; set; }` | `bendingDetailCustomFieldProperties.SegmentLengthsForArcsDisplayOption` | BendingDetailSegmentLengthsDisplayOptions |
| `BendingDetailSegmentsRepresentation SegmentsRepresentation { get; set; }` | `bendingDetailCustomFieldProperties.SegmentsRepresentation` | BendingDetailSegmentsRepresentation |
| `Boolean AreEqualTo(ICustomFieldProperties)` | `bendingDetailCustomFieldProperties.AreEqualTo(otherProperties)` | Boolean |
| `Void Dispose()` | `bendingDetailCustomFieldProperties.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```